0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version		2.0;
    format		ascii;
    class		volScalarField;
    object		T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type		fixedValue;
        value	uniform 1;
    }

    outlet
    {
        type		zeroGradient;
    }

    symplane
    {
        type		symmetryPlane;
    }

    wall
    {
        type		fixedValue;
        value	uniform 1;
    }

    topbottom
    {
        type		empty;
    }
}

// ************************************************************************* //
