0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	volVectorField;
    object	U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type		pressureInletOutletVelocity;
        value	uniform (100 0 0);
    }

    outlet
    {
        type		zeroGradient;
    }

    wall
    {
        type		slip;
    }

    symplane
    {
        type		symmetryPlane;
    }


    topbottom
    {
        type		empty;
    }
}

// ************************************************************************* //
