constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (   0   0 0) // 0
    ( 700   0 0) // 1
    (3000   0 0) // 2
    (3000 700 0) // 3
    ( 700 438 0) // 4
    (   0 500 0) // 5
    (   0   0 1) // 6
    ( 700   0 1) // 7
    (3000   0 1) // 8
    (3000 700 1) // 9
    ( 700 438 1) // 10
    (   0 500 1) // 11
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (50 20 1) simpleGrading (1 1 1)
    hex (1 2 3 4 7 8  9 10) (150 20 1) simpleGrading (1 1 1)
);

edges
(
    arc 3   4 (2200  453.2 0)
    arc 4   5 (351.4 484.5 0)
    arc 9  10 (2200  453.2 1)
    arc 10 11 (351.4 484.5 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 11 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 8 9 3)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (3 9 10 4)
            (5 11 10 4)
        );
    }
    symplane
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
        );
    }
    topbottom
    {
        type empty;
        faces
        (
            (0 5 4 1)
            (1 4 3 2)
            (6 7 10 11)
            (7 8 9 10)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
